{
  "jobs": [
    {
      "title": "Senior Software Engineer",
      "company": "Health Recovery Solutions",
      "startDate": "2017-02-01",
      "endDate": null,
      "description": "<p>I work on anything and everything to provide software solutions that improve the experience and readmission rate of patients in the healthcare industry.</p><p>Projects include:</p><ul><li>Building a modern Angular web app that allows clinicians to quickly and easily access patient data, view charts and reports, and identify potential health risks with their patients.</li><li>Developing native Android apps for tablets used by patients to upload medical data (such as blood pressure or glucose levels) using bluetooth peripherals, as well as communicate with their clinicians via text, voice, or video chat.</li><li>Enhancing a Cordova app for Android and iOS mobile phones, used by clinicians to supplement our web app.</li><li>Creating a Codeception test suite with Selenium for acceptance testing.</li></ul><p>Primary technologies: PHP, Javascript, Java, Android, Cordova, MySQL, Docker, Linux, Git, Jira</p>"
    },
    {
      "title": "Senior Software Engineer",
      "company": "Wayfair",
      "startDate": "2013-08-01",
      "endDate": "2017-01-31",
      "description": "<p>As the tech lead of a team of software engineers, I helped Wayfair transform into a global company. I was responsible for building a flexible, extensive localization framework that was used by hundreds of engineers. Additionally, I worked closely with business stakeholders to identify and prioritize my team’s engineering work and ensure we were furthering business initiatives.</p><p>Projects included:</p><ul><li>Building a process for machine translation of customer-facing data into different languages.</li><li>Integrating with a third party, Smartling, using their RESTful API to send and receive data for manual translation.</li><li>Building a C# library of data models as well as a WCF service, Windows service, and Windows Forms application.</li><li>Developing full stack MVC web apps using Wayfair’s Tungsten.js, PHP, and Mustache.</li><li>Devising a system for tracking the translation status of data, including automatic flagging for re-translation.</li><li>Creating generic UI components and web service endpoints enabling other engineers to localize their applications.</li></ul><p>Other tasks include: Mentoring new hires and interns, doing code reviews, interviewing candidates, and participating in Wayfair’s Emerging Manager training program</p><p>Primary technologies: PHP, C#, Javascript (Backbone, jQuery), SQL Server, WCF, Git, SVN</p>"
    },
    {
      "title": "Software Engineer",
      "company": "Blackbaud",
      "startDate": "2010-05-01",
      "endDate": "2013-08-01",
      "description": "<p>I worked on feature development for our CRM applications on the web and Windows. I worked on all layers of the tech stack on a geographically dispersed agile team managing both new features and production software patches.</p><p>Projects included:</p><ul><li>Building two-way data synchronization between separate applications when Blackbaud acquired a competitor, Convio. This work included creating a WCF web service to communicate with a message queueing service bus, UIs for review of data, and deployment components.</li><li>Developing web services that powered Blackbaud’s Android and iOS apps.</li><li>Adding new features to Blackbaud’s web and desktop CRM applications, including fuzzy search capability, data de-duplication, a generic query builder user interface, and dashboards.</li></ul><p>Primary technologies: C# and VB.NET, WCF, Javascript (Ext JS, jQuery), SQL Server, TFS</p>"
    },
    {
      "title": "Software Quality Engineer",
      "company": "Blackbaud",
      "startDate": "2007-06-01",
      "endDate": "2010-05-01",
      "description": "I developed an automated software UI testing suite tied to continuous integration builds, testing both web and Windows applications. I became responsible for leading and mentoring three other engineers, and participated in planning and prioritizing projects for the team. In my spare time I familiarized myself with Blackbaud’s frameworks and completed software development tasks that enabled me to move into the Software Engineer role."
    },
    {
      "title": "Information Management Leadership Program Intern",
      "company": "General Electric",
      "startDate": "2006-06-01",
      "endDate": "2006-08-31",
      "description": "This internship was focused on IT project management, delivering on a database migration project involving independent contractors."
    },
    {
      "title": "Web Development Intern",
      "company": "WebQuix",
      "startDate": "2006-01-01",
      "endDate": "2006-05-31",
      "description": "I built websites using HTML, CSS, JavaScript and PHP as part of a software startup catering to professional photographers."
    }
  ],
  "education": [
    {
      "degree": "M.S. in Computer Information Systems",
      "school": "Boston University",
      "endDate": "2016-05-01",
      "description": "<p>This program was a mix of software development and technology leadership courses that I pursued while working full-time for Wayfair.</p><p>Notable courses:</p><ul><li>IT Strategy and Management</li><li>Project Management</li><li>Enterprise Architecture</li><li>System Analysis</li><li>Web Application Development with AngularJS</li><li>Database Design</li></ul>"
    },
    {
      "degree": "B.S. in Computer Information Systems",
      "school": "Clemson University",
      "endDate": "2007-05-01",
      "description": "This program was made up primarily of computer science courses, with just a splash of business and management."
    }
  ]
}
